bark-no-dog-spec/app/views/dogs/_dog.html.erb

  </p>
  <% if dog.statuses.present? %>
---
SELECT "statuses".* FROM "statuses"  WHERE "statuses"."dog_id" = ?  [["dog_id", 1]]