bark-no-dog-spec/app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("birthday", "city", "created_at", "email", "name", "newsletter", "password_digest", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @dog = Dog.new(dog_params)
    if @dog.save