bark-no-dog-spec/app/controllers/sessions_controller.rb

SELECT  "dogs".* FROM "dogs"  WHERE "dogs"."email" = 'bark@dev.com' LIMIT 1
---
  def create
    @dog = Dog.find_by_email(params[:email])