bark-no-dog-spec/app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("body", "created_at", "dog_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Bark bark woof woof baaaark?"], ["created_at", "2016-11-16 15:47:49.645624"], ["dog_id", 1], ["updated_at", "2016-11-16 15:47:49.645624"]]
---
  def create
    @status = Status.new(status_params)
    @status.dog_id = params[:dog_id]
    if @status.save

UPDATE "statuses" SET "body" = ?, "updated_at" = ? WHERE "statuses"."id" = 1  [["body", "Woo I'm a dog, again."], ["updated_at", "2016-11-16 15:55:23.501519"]]
---
  def update
    if @status.update(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]
---
  def destroy
    @status.destroy